2022-07-27-org-mode.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>org-mode</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Buscar..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">27 jul 2022</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2022-07-27-org-mode.html"
          >org-mode</a
        >
      </h1>
      <p>
        Org-mode es un gestor de información personal y una herramienta de
        resúmenes para Emacs.
      </p>
      <div id="outline-container-orgf92585a" class="outline-2">
        <h2 id="orgf92585a">Lo básico</h2>
        <div class="outline-text-2" id="text-orgf92585a"></div>
        <div id="outline-container-org50a8542" class="outline-3">
          <h3 id="org50a8542">Creando un nuevo fichero</h3>
          <div class="outline-text-3" id="text-org50a8542">
            <p>
              Emacs debería entrar en org-mode siempre y cuando se visite o cree
              un fichero con la extensión ".org"
            </p>
          </div>
        </div>
        <div id="outline-container-org669301d" class="outline-3">
          <h3 id="org669301d">Lista simple de tareas</h3>
          <div class="outline-text-3" id="text-org669301d">
            <p>
              Los títulos de primer nivel empiezan con una estrella; los de
              segundo nivel con dos estrellas, y así. En org-mode, los ítems
              TODO (tareas no hechas) son siempre títulos. Para crear nuevos
              items TODO se ubica el cursor en la siguiente línea y se pulsa
              M-shift-RET para llamar a org-insert-todo-heading. Se puede pulsar
              varias veces y añadir varios TODOs. Para marcar una tarea como
              realizada márquese el ítem TODO como ítem DONE (tarea ya
              realizada) moviendo el cursor a esa línea y pulsando C-c C-t, que
              ejecuta el comando org-todo. Nótese cómo org-mode usa una marca de
              tiempo para grabar cuando un ítem TODO fué cerrado.
            </p>
          </div>
        </div>
        <div id="outline-container-org7df1be0" class="outline-3">
          <h3 id="org7df1be0">Usando títulos para estructurar el documento</h3>
          <div class="outline-text-3" id="text-org7df1be0">
            <p>
              Con frecuencia el mejor camino para organizar ideas es un esquema.
              El siguiente paso es hacer un esquema de los diferentes asuntos
              del tutorial. Haciendo esto, se rompe la intimidatoria página en
              blanco en una serie de pequeños trozos menos intimidatorios. Una
              asterisco da comienzo a una cabecera de primer nivel, y dos
              asteriscos dan comienzo a una cabecera de segundo nivel. Si se
              necesita un anidamiento más profundo, ¡usá tres o más asteriscos!
            </p>
          </div>
        </div>
        <div id="outline-container-org16c0e65" class="outline-3">
          <h3 id="org16c0e65">Rellenando secciones</h3>
          <div class="outline-text-3" id="text-org16c0e65">
            <p>
              Fácilmente se puede añadir texto, un cuerpo de texto debajo de
              cada título.
            </p>
          </div>
        </div>
        <div id="outline-container-org90c9b9a" class="outline-3">
          <h3 id="org90c9b9a">Enlaces a otros lugares</h3>
          <div class="outline-text-3" id="text-org90c9b9a">
            <p>
              La sintaxis para crear enlaces es [[enlace][descripción] El último
              corchete lo dejo abierto por que al cerrarlo se escondería el
              enlace y solo se vería descripción. Para editar un enlace ya
              oculto se presiona C-c C-o para org-open-at-point(abrir enlace)
            </p>

            <p>
              También se puede enlazar archivos locales con C-c C-l
              <a href="file:///home/martin/.emacs"
                >archivo de configuracion de emacs</a
              >
            </p>
          </div>
        </div>
        <div id="outline-container-orgf6e7215" class="outline-3">
          <h3 id="orgf6e7215">Añadiendo notas a una tarea</h3>
          <div class="outline-text-3" id="text-orgf6e7215">
            <p>
              Se puede poner tanto texto como se quiera bajo una cabecera de un
              ítem TODO. De hecho, se puede tener incluso subcabecera bajo un
              TODO, ¡y TODOs con TODOs!
            </p>

            <p>
              Siendo capaz de anotar tareas hace fácil recoger enlaces
              relacionados y pensamientos asociados a una tarea. Siendo capaz de
              anidar tareas es bueno para modelar flujos de trabajo — con
              bastante frecuencia, una tarea larga is dividida en pequeñas
              subtareas que se pretende marchar según se hagan.
            </p>

            <table>
              <colgroup>
                <col class="org-left" />

                <col class="org-right" />

                <col class="org-right" />

                <col class="org-right" />
              </colgroup>
              <thead>
                <tr>
                  <th scope="col" class="org-left">Item</th>
                  <th scope="col" class="org-right">Quantity</th>
                  <th scope="col" class="org-right">Price</th>
                  <th scope="col" class="org-right">Total</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td class="org-left">Apples</td>
                  <td class="org-right">10</td>
                  <td class="org-right">2</td>
                  <td class="org-right">20</td>
                </tr>

                <tr>
                  <td class="org-left">Oranges</td>
                  <td class="org-right">5</td>
                  <td class="org-right">3</td>
                  <td class="org-right">15</td>
                </tr>

                <tr>
                  <td class="org-left">Bananas</td>
                  <td class="org-right">5</td>
                  <td class="org-right">1</td>
                  <td class="org-right">7</td>
                </tr>
              </tbody>
              <tbody>
                <tr>
                  <td class="org-left"><b>Sum</b></td>
                  <td class="org-right">20</td>
                  <td class="org-right">&#xa0;</td>
                  <td class="org-right">42</td>
                </tr>
              </tbody>
            </table>
          </div>
        </div>
      </div>
      <div id="outline-container-org89bc3aa" class="outline-2">
        <h2 id="org89bc3aa">Funcionalidades avanzadas</h2>
        <div class="outline-text-2" id="text-org89bc3aa">
          <p>
            <a
              href="https://orgmode.org/worg/org-tutorials/orgtutorial_dto-es.html"
              >Esto es solo un resumen de un tutorial que está aquí</a
            >
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-emacs.html">emacs</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
